# SurfaceAreaPerUnitLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..SurfaceAreaPerUnitLength Property
SpecTypeId Class See Also
---
Surface Area per Unit Length, in discipline Structural.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId SurfaceAreaPerUnitLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SurfaceAreaPerUnitLength As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SurfaceAreaPerUnitLength {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace